In [1]:
import numpy as np
import pandas as pd

In [6]:
np.random.seed(100)

In [11]:
random = np.random.randn(3, 5)
baris = ['A', 'B', 'C']
kolom = ['satu', 'dua', 'tiga', 'empat', 'lima']
dataku = pd.DataFrame(random, baris, kolom)
dataku

       satu       dua      tiga     empat      lima
A -0.881798  0.018639  0.237845  0.013549 -1.635529
B -1.044210  0.613039  0.736205  1.026921 -1.432191
C -1.841188  0.366093 -0.331777 -0.689218  2.034608

In [15]:
dataku['tiga']

A    0.237845
B    0.736205
C   -0.331777
Name: tiga, dtype: float64

In [16]:
type(dataku['tiga'])

pandas.core.series.Series

In [17]:
type(dataku)

pandas.core.frame.DataFrame

In [19]:
dataku['baru'] = dataku['empat'] + dataku['lima']
dataku

       satu       dua      tiga     empat      lima      baru
A -0.881798  0.018639  0.237845  0.013549 -1.635529 -1.621981
B -1.044210  0.613039  0.736205  1.026921 -1.432191 -0.405269
C -1.841188  0.366093 -0.331777 -0.689218  2.034608  1.345390

In [21]:
dataku.drop('tiga', axis=1)

       satu       dua     empat      lima      baru
A -0.881798  0.018639  0.013549 -1.635529 -1.621981
B -1.044210  0.613039  1.026921 -1.432191 -0.405269
C -1.841188  0.366093 -0.689218  2.034608  1.345390

In [22]:
dataku

       satu       dua      tiga     empat      lima      baru
A -0.881798  0.018639  0.237845  0.013549 -1.635529 -1.621981
B -1.044210  0.613039  0.736205  1.026921 -1.432191 -0.405269
C -1.841188  0.366093 -0.331777 -0.689218  2.034608  1.345390

In [27]:
dataku = dataku.drop('tiga', axis=1)

       satu       dua     empat      lima      baru
A -0.881798  0.018639  0.013549 -1.635529 -1.621981
B -1.044210  0.613039  1.026921 -1.432191 -0.405269
C -1.841188  0.366093 -0.689218  2.034608  1.345390

In [28]:
dataku.drop('baru', axis=1, inplace=True)

In [29]:
dataku

       satu       dua     empat      lima
A -0.881798  0.018639  0.013549 -1.635529
B -1.044210  0.613039  1.026921 -1.432191
C -1.841188  0.366093 -0.689218  2.034608

In [30]:
dataku.drop('B', axis=0, inplace=True)

In [31]:
dataku

       satu       dua     empat      lima
A -0.881798  0.018639  0.013549 -1.635529
C -1.841188  0.366093 -0.689218  2.034608

In [32]:
dataku.shape

(2, 4)

In [34]:
data_bol = dataku < 0

In [35]:
data_bol

   satu    dua  empat   lima
A  True  False  False   True
C  True  False   True  False

In [36]:
dataku[data_bol]

       satu  dua     empat      lima
A -0.881798  NaN       NaN -1.635529
C -1.841188  NaN -0.689218       NaN

In [37]:
dataku[dataku < 0]

       satu  dua     empat      lima
A -0.881798  NaN       NaN -1.635529
C -1.841188  NaN -0.689218       NaN

In [38]:
random = np.random.randn(3, 5)
baris = ['A', 'B', 'C']
kolom = ['satu', 'dua', 'tiga', 'empat', 'lima']
dataku = pd.DataFrame(random, baris, kolom)
dataku

       satu       dua      tiga     empat      lima
A -0.550714  0.750453 -1.306992  0.580573 -1.104523
B  0.690121  0.686890 -1.566688  0.904974  0.778822
C  0.428233  0.108872  0.028284 -0.578826 -1.199451

In [39]:
dataku[dataku['lima'] < 0]

       satu       dua      tiga     empat      lima
A -0.550714  0.750453 -1.306992  0.580573 -1.104523
C  0.428233  0.108872  0.028284 -0.578826 -1.199451